idaohang/stm32gps-sleep/Project/stm32gps/main.c
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stGPSData.course.s[1 - i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mcc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mnc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Lac[i];
        offset++;
    }
	gpsBuf[offset] = 0;  // 补零
    offset++;
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Ci[i];
        offset++;
    }
    gpsBuf[offset] = stGPSData.status;
    offset++;
    gpsBuf[offset] = 0;  // device status
    offset++;
    gpsBuf[offset] = STM_EVAL_PBGetState(BUTTON_KEY);  // device status
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stBATInfo.BatVoltage.s[1 - i];
        offset++;
    }

	gpsBuf[offset] = 0;  // 补零
    offset++;
	gpsBuf[offset] = ucSignalQuality; 
    offset++;
    for(i = 0; i < IMEI_BUF_LEN; i++)
    {
        gpsBuf[offset] = ucIMEIBuf[i];
        offset++;
    }

    for(i = 0; i < IMSI_INFO_LEN; i++)
    {
        gpsBuf[offset] = g_IMSIBuf[i];
        offset++;
    }
    for(i = 0; i < PHONE_NUMBER_LEN; i++)
    {
        gpsBuf[offset] = g_phoneNum[i];
        offset++;
    }
    gpsBuf[offset] = ucGPSStatus;  // gps status
    offset++;
    gpsBuf[offset] = 0x02;  // software version v2.0
    offset++;
    gpsBuf[offset] = 0x00;
    offset++;

    if(offset != (FACTORY_REPORT_MSGLEN))
    {
        DEBUG("PackFactoryMsg ERROR!\n");
    }
}

/**
 * @}
 */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
